var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "赵磊",
    sex: "男",
    age: "19",
    phone: "18203383604",
    email: "2316811443@qq.com",
    address: "现居河北省石家庄市",
    qq: "2316811443",
    log: "个人简历",
    excpect_work: "Java后端开发",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "明天不一定会更好，但要坚信更好的明天一定会来。",
        "要做的事情总找得出时间和机会，不愿意做的事情也总能找得出借口。",
        "Gor For It!",
        "有智者立长志，无志者长立志。",
        "那些过去的眼泪终将风干在记忆里。",
        "真相，是为了剿灭幻想。",
        "我欲将心向明月，奈何明月照沟渠。",
        "春风得意马蹄疾，一日看尽长安花。",
        "天凉好个秋！",
        "老骥伏枥，志在千里。烈士暮年，壮心不已。",
        "老当益壮，宁移白首之心。穷且益坚，不坠青云之志。",
        "我们必须拿我们所有的， 去换我们所没有的",
        "蒹葭苍苍，白露为霜；所谓伊人，在水一方。",
        "数风流人物，还看今朝！"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "青青子衿，悠悠我心<br>" +
             "但为君故，沉吟至今<br>" +
             "您好，我是赵磊，石家庄铁道大学软件工程大四毕业生<br>" +
             "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>您好！我叫赵磊，性别男。我期望的工作岗位是Java后端开发</p>" +
        "<p>学习成绩:班级排名前三,专业排名前10%</p>" +
        "<p>语言能力:CET-4,普通话二乙;乐观开朗善于人际沟通，语言表达能力强</p>" +
        "<p>办公能力:在学校里经营过外卖小程序，并广泛推广。大一在校组织任职办公过</p>" +
        "<p>专业能力:对很多种机器语言都有所了解，其中最为熟练的是java</p>" +

        "<p></p>" +
        "<p>十分期待与您的联系!</p>",



    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["Java", 80, "red"],
        ["C/C++", 80, "#1F1ABCFF"],
        ["Pythhon", 77, "blue"],
        ["SQL", 75, "#1abc9c"],
        ["HTML5", 67, "rgba(0,0,0)"],
        ["CSS3", 60, "yellow"],
        ["JavaScript", 70, "pink"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>数据结构、计网、计组、计算机网络等编程基础知识良好。</li>" +
        "     <li>熟练掌握c、c++、java、python、lua脚本语言开发基本知识。</li>" +
        "     <li>熟悉JavaIO、多线程、集合等基础框架。</li>" +
        "     <li>了解JVM原理。</li>" +
        "     <li>熟悉SQL语句编写以及调优。</li>" +
        "     <li>熟悉基本Linux命令操作。</li>" +
        "     <li>熟悉Spring、ibatis、struts等框架的使用，了解其原理与机制。</li>" +
        "     <li>熟悉缓存、消息等机制。</li>" +
        "     <li>了解分布式系统的设计与应用。</li>" +
        "     <li>熟悉HTML、CSS、JavaScript以及相应前端知识。</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./images/bokeyuan.png", "https://home.cnblogs.com/u/zhaolei0419", "个人博客", "这里记录了我的学习笔记<br>持续更新"],
        ["./images/pro_2.png", "https://github.com/airlei/StudentRecognition", "学生考勤人脸识别", "基于SpringMvc架构<br>全部完成"],
        ["./images/pro_3.png", "https://github.com/airlei/ProgramInUniversity", "基于JFinal框架实现的学生选课系统", "项目里面是大学所写代码的集合"]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>期待您的联系。</p>"]

        ["2020/10 — 2021/9", "<br>在校组织任职，负责学校公众号的推文",
            "<p><strong>石铁大壹青年</strong></p>" +
            "<p>大一期间，在校组织里面成长了许多，不仅学习到了许多办公技能，还学习到了公众号的运营管理。</p>"
        ],

        ["2022/9 — 2023/6", "<br>经营校园外卖平台",
            "<p><strong>铁小泽外卖平台</strong></p>" +
            "<p>大二期间，和同学共投资经营石铁大外卖平台，这段时间每天真的很累，但是所经历的成长也是非常可贵的</p>" +
            "<p>后来因学业繁重，疫情结束，学校放开，就放弃对平台的管理</p>"
        ]

    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2022年3月：荣获蓝桥杯省内三等奖","",""],
        ["2022.09：荣获国家励志奖学金","",""],
        ["2022年10月：冀青项目调研省内立项","",""],
        ["2023年5月 荣获火焰杯优秀奖","",""],
        ["其他荣誉","此外，还担任班级学习委员，获得多次奖学金、三好学生、院级、校级优秀团员，以及学校的其他各种奖项",""]
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
    icon: [
        // ["./svg/LeetCode.svg", "https://leetcode.cn/u/OqtCX3Iexw/", "我的力扣主页"],
        ["./svg/github.svg", "https://github.com/airlei", "我的GitHub主页"],
        ["./svg/博客.svg", "https://home.cnblogs.com/u/zhaolei0419", "我的个人博客"],
        // ["./svg/掘金.svg", "", "我的掘金主页"],
        ["./svg/csdn.svg", "https://blog.csdn.net/xiaoaozhao", "我的CSDN"]
    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/avatar.jpg",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

}
